# Логистическая регрессия

В этом задании необходимо дописать класс LogisticRegression и применить его для задачи прогназирования погибших людей на титанике. Для сдачи задания придётся зарегистрироваться в платформе https://www.kaggle.com/ . В найдёте соревнование https://www.kaggle.com/c/titanic, в котором нужно будет принять участие. Для сдачи этого задания нужно указать свой никнейм, для проверки позиции на доске участников и прислать выполненный ноутбук.

### Нужно загрузить данные из файла titanic.csv с помощью библиотеки pandas. И вывести результат

Используйте функцию `read_csv` и параметр `index_col` для столбца с именем `PassengerId`, чтобы этот столбец превратился в индекс. 

Воспользутей функцией `head`, чтобы вывести DataFrame как таблицу

In [1]:
import pandas as pd

dataset = ### КОД ЗДЕСЬ
dataset.### КОД ЗДЕСЬ

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Извлеките только столбцы с именами 'Fare', 'Pclass', 'Age', 'Sex', 'Survived'

`dataset[['Collumn_name']]` синтаксис, преобразуйте категориальный признак `Sex` в числа, 0 и 1.

In [2]:
dataset = ### КОД ЗДЕСЬ
### КОД ЗДЕСЬ
### КОД ЗДЕСЬ
dataset.head()

                Fare  Pclass   Age  Sex  Survived
PassengerId
1             7.2500       3  22.0    1         0
2            71.2833       1  38.0    0         1
3             7.9250       3  26.0    0         1
4            53.1000       1  35.0    0         1
5             8.0500       3  35.0    1         0

### Избавьтесь от пропусков 

Посмотрите на данные, обратите внимание на значения `NaN` в поле `Age`. Для обучающей выборки можно отбросить данные с пропусками функцией `dropna`, но лучше подставить некоторое значение. Для этого задания замените все пропуски с помощью среднего по столбцу возраст. Воспользуйтесь функцией `fillna` и передайте туда среднее

In [3]:
mean_age = dataset['Age'].mean()

dataset['Age'] = ### КОД ЗДЕСЬ

### Разбейте датасет на признаки X и метки y. Преобразуйте их в numpy массивы

In [4]:
import numpy as np
X = np.array( dataset[['Fare', 'Pclass', 'Age', 'Sex']] )
y = np.array( dataset[['Survived']] )[:,0]

### Обучите логистическую регрессию

Убедитесь что вы завершили работу в файле ```linear_model.py```.

In [5]:
from linear_model import LogisticRegression

In [6]:
clf = LogisticRegression(epsilon=0.000001)

In [10]:
clf.fit(X,y, verbose=False)

### Посмотрите значение целевой функции

In [11]:
clf.cost(X, y)

0.51567329458777333

### Предсказание на тестовых данных

Чтобы завершить задание скачайте тестовую выборку с kaggle. И загрузите датасет

In [17]:
testset = ### КОД ЗДЕСЬ
### КОД ЗДЕСЬ

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Проделайте такие же преобразования

- возьмите только столбцы ['Fare', 'Pclass', 'Age', 'Sex']
- замените текстовое представление пола на числовое 
- замените пропуски в возрасте средним значением по столбцу Age

In [18]:
testset = ### КОД ЗДЕСЬ
### КОД ЗДЕСЬ
### КОД ЗДЕСЬ

# В датасете есть ещё пропуск в одном месте, заполним его просто нулём
testset = testset.fillna(0)
testset.head(5)

                Fare  Pclass   Age  Sex
PassengerId
892           7.8292       3  34.5    1
893           7.0000       3  47.0    0
894           9.6875       2  62.0    1
895           8.6625       3  27.0    1
896          12.2875       3  22.0    0

In [19]:
# Преобразуем DataFrame в массив 
X_test = ### КОД ЗДЕСЬ см. пример с обучающей выборкой

In [20]:
# Получим результат в виде вероятностей
result = clf.predict(X_test)

In [21]:
# заменим вероятности метками классов 
result[[result>0.5]]=1
result[[result<0.5]]=0

### Сформируйте результат в заданном формате и отправьте результат в kaggle

Ожидаемый результат около 74% точности

In [22]:
testset.insert(0,"Survived",result)
testset['Survived'] = testset['Survived'].astype(int)
testset[['Survived']].to_csv('submition.csv')

### Отправьте выполненное задание на проверку, с указанием имени пользователя, для проверки в kaggle